#---------------------------------------------------
def message():
    print("-----------")
    print("[การทดสอบ]")
    print("-----------")
#---------------------------------------------------
def vInput(x,y):
    area = int(x) * int (y) 
    print("ค่าของพื้นที่สีเหลี่ยม :",area)
#---------------------------------------------------    
def re():
    zed = input("ค่าที่คุณใส่ตัวแปล :")
    return zed
#---------------------------------------------------
def Inre(x,y):
    area = 0.5 * int(x) * int(y)
    return area
#---------------------------------------------------

#---------------------------------------------------
print("--------------------------------------")
print("1 = ไม่มีการรับค่าตัวแปลและไม่มีการส่งค่าออก   ")
print("2 = มีการรับค่าตัวแปล แต่ไม่มีการส่งค่าตัวแปลออก")
print("3 = ไม่มีการรับค่าตัวแปล แต่มีการส่งค่าตัวแปลออก")
print("4 = มีการรับค่าตัวแปล และมีการส่งค่าตัวแปลออก")
print("5 = ใช้งานฟังค์ชั่นร่วมกัน")
print("---------------------------------------")

Test = input ("[โปรดเลือกข้อที่คุณต้องการ] =:")

if (Test == '1'):
    message()
elif (Test == '2'):
    a = input("ความกว้าง :")
    r = input("ความยาว :")
    vInput(a,r)
elif (Test == '3'):
   turn = re()
   print ("ค่าที่ส่งมาจากฟังค์ชั่น-->",c)
elif (Test == '4'):
    a = input("ความกว้าง :") 
    r = input("ความยาว :")
    j = Inre(a,r)
    print("พื้นที่สามเหลียม คือ :",j)
elif (Test == '5'):
    message()
    a = re()
    b = re()
    j = Inre(a,b)
    print("พื้นที่สามเหลี่ยมคือ :",j)                   



